
**Task 0**

Необходимо написать программу, где бы пользователю предлагалось ввести число на выбор: 1, 2 или 3, 
а программа должна сказать, какое число ввёл пользователь: 1, 2, или 3

**Task 1**

- Запишите в 4 переменные случайные числа от 0 до 100 
- Выведите все 4 на экран 
- Программа должна определить максимальное из этих четырех чисел 
- Результат вывести на экран

**Task 2** *Повышенной сложности (опционально)

- программа предлагает пользователю ввести четырехзначное число
- Причем: мы можем получать от пользователя **ТОЛЬКО** строки. Данные в формате String
- Если число не четырехзначное, должно вывестись на экран сообщение об ошибке и работа программы завершается
- Проверить, является ли число "счастливым билетом". Т.е. совпадает ли сумма цифр первых двух цифр числа с суммой третьей и четвертой цифры

Пример: 
- число 1450 -> (1+4) = 5; (5+0) = 5; 5 равно 5 - число счастливое
- число 1654 -> (1+6) = 7; (5+4) = 9; 7 не равно 9 - число НЕ является счастливым


**Task 3** со звездочкой
Построчно сократить логическое выражения (соблюдая приоритетность операций)
```
System.out.println((true | false) | (45 < 70) & !(true) ^ (6 == 5));
```

Пример выполнения:
```
System.out.println(true || false ^ true && !true);
System.out.println(true || false ^ true && false);
System.out.println(true || true && false);
System.out.println(true || false);
System.out.println(true);
```

Убедиться, что во всех выведенных строчках выводится одинаковое значение типа boolean
